{
  "texts": [
    "Incrível progresso! Você está dominando os conceitos fundamentais de programação. Continue assim!",
    "Cada desafio que você completa é um passo em direção ao seu objetivo como programador. Não desista!",
    "Você está construindo sua base de conhecimento a cada desafio. O caminho para se tornar programador é exatamente assim!",
    "Seu empenho está dando resultados! Lembre-se que todo programador experiente já esteve onde você está agora.",
    "Persistência é a chave para o sucesso na programação. E você está demonstrando isso!",
    "Você já aprendeu tanto! Imagine onde estará daqui a alguns meses se continuar nesse ritmo.",
    "Ótimo trabalho! Sua jornada na programação está apenas começando, e você já está brilhando!",
    "A persistência é o que transforma a dificuldade em conquista. Continue programando!",
    "Cada linha de código que você escreve, cada problema que resolve, está construindo seu futuro como programador.",
    "Dez desafios completos! Você está desenvolvendo o mindset de um programador de verdade.",
    "Sua dedicação está rendendo frutos! Continue aprendendo, continue codando.",
    "Os melhores programadores são aqueles que não desistem quando encontram dificuldades. Você está no caminho certo!",
    "Parabéns pelo seu progresso! Lembre-se: a programação é uma maratona, não uma corrida de velocidade.",
    "Você está cultivando uma habilidade que mudará seu futuro. Continue avançando!",
    "Com cada desafio, você expande sua mente e se aproxima de se tornar o programador que deseja ser.",
    "Sensacional! Você está demonstrando as qualidades essenciais de um programador: persistência e vontade de aprender.",
    "Continue resolvendo problemas, um após o outro. É assim que se constrói uma carreira em programação!",
    "Sua jornada de aprendizado está progredindo maravilhosamente! Não se esqueça de olhar para trás e ver o quanto já avançou.",
    "Você está construindo sua confiança a cada desafio. Esta é uma habilidade tão importante quanto o conhecimento técnico!",
    "Cada desafio completado é uma vitória. Continue somando estas vitórias em sua jornada como programador!",
    "A programação é feita de pequenas vitórias diárias. Você está acumulando muitas delas!",
    "Sua determinação é inspiradora! Continue praticando, e você verá como a programação se tornará natural.",
    "O segredo do sucesso em programação é a prática constante. Você está no caminho certo!",
    "Dez novos desafios concluídos! Seu cérebro está formando novas conexões a cada problema que você resolve.",
    "Seu progresso é a prova de que você tem o que é preciso para se tornar um programador de sucesso.",
    "A jornada do programador é feita de desafios. E você está mostrando que sabe como superá-los!",
    "Continue codando, continue aprendendo. Seu futuro como programador está sendo construído agora!",
    "Está vendo como você consegue? Esse é o poder da persistência que todo bom programador precisa ter.",
    "Mais dez desafios conquistados! Você está desenvolvendo um superpoder: resolver problemas com código!",
    "Você está transformando dificuldades em conhecimento. Esta é a essência da programação!"
  ]
} 