{
  "texts": [
    "¡Progreso increíble! Estás dominando los conceptos fundamentales de programación. ¡Sigue así!",
    "Cada desafío que completas es un paso hacia tu objetivo como programador. ¡No te rindas!",
    "Estás construyendo tu base de conocimiento con cada desafío. ¡El camino para convertirse en programador es exactamente así!",
    "¡Tu esfuerzo está dando resultados! Recuerda que todo programador experimentado ya estuvo donde tú estás ahora.",
    "La persistencia es la clave del éxito en programación. ¡Y tú lo estás demostrando!",
    "¡Ya has aprendido tanto! Imagina dónde estarás en unos meses si continúas a este ritmo.",
    "¡Excelente trabajo! Tu viaje en programación apenas está comenzando, ¡y ya estás brillando!",
    "La persistencia es lo que transforma la dificultad en logro. ¡Sigue programando!",
    "Cada línea de código que escribes, cada problema que resuelves, está construyendo tu futuro como programador.",
    "¡Diez desafíos completados! Estás desarrollando la mentalidad de un verdadero programador.",
    "¡Tu dedicación está dando frutos! Sigue aprendiendo, sigue programando.",
    "Los mejores programadores son aquellos que no se rinden cuando encuentran dificultades. ¡Estás en el camino correcto!",
    "¡Felicidades por tu progreso! Recuerda: la programación es una maratón, no una carrera de velocidad.",
    "Estás cultivando una habilidad que cambiará tu futuro. ¡Sigue avanzando!",
    "Con cada desafío, expandes tu mente y te acercas a convertirte en el programador que deseas ser.",
    "¡Sensacional! Estás demostrando las cualidades esenciales de un programador: persistencia y ganas de aprender.",
    "Sigue resolviendo problemas, uno tras otro. ¡Así es como se construye una carrera en programación!",
    "¡Tu viaje de aprendizaje está progresando maravillosamente! No olvides mirar atrás y ver cuánto has avanzado.",
    "Estás construyendo tu confianza con cada desafío. ¡Esta es una habilidad tan importante como el conocimiento técnico!",
    "Cada desafío completado es una victoria. ¡Sigue sumando estas victorias en tu viaje como programador!",
    "La programación está hecha de pequeñas victorias diarias. ¡Estás acumulando muchas de ellas!",
    "¡Tu determinación es inspiradora! Sigue practicando, y verás cómo la programación se volverá natural.",
    "El secreto del éxito en programación es la práctica constante. ¡Estás en el camino correcto!",
    "¡Diez nuevos desafíos completados! Tu cerebro está formando nuevas conexiones con cada problema que resuelves.",
    "Tu progreso es la prueba de que tienes lo necesario para convertirte en un programador exitoso.",
    "¡El viaje del programador está hecho de desafíos. Y estás mostrando que sabes cómo superarlos!",
    "Sigue programando, sigue aprendiendo. ¡Tu futuro como programador se está construyendo ahora!",
    "¿Ves cómo puedes hacerlo? Ese es el poder de la persistencia que todo buen programador necesita tener.",
    "¡Diez desafíos más conquistados! Estás desarrollando un superpoder: ¡resolver problemas con código!",
    "Estás transformando las dificultades en conocimiento. ¡Esta es la esencia de la programación!"
  ]
} 